redis gyak

> get tanulo05
"WRONGTYPE Operation against a key holding the wrong kind of value"

> get tanulo
(nil)

> get sorozat1
"WRONGTYPE Operation against a key holding the wrong kind of value"

> get sorozat
(nil)

> set proba "Kiss Béla"
"OK"

> get proba
"Kiss B\xc3\xa9la"

> get tanulo02
"Nagy Iv\xc3\xb3"

> set lejar "gyors" ex 10
"OK"

> set lejar "gyors" ex 10
"OK"

> get lejar
(nil)

> get tanulo02
"Nagy Iv\xc3\xb3"

> get dolgozo:1
"WRONGTYPE Operation against a key holding the wrong kind of value"

> get dolgozo:1:nev
"Nagy Eva"

> hset tanuloo nev "asd" varos "gyongyos"
(integer) 2

> get tanuloo
"WRONGTYPE Operation against a key holding the wrong kind of value"

> get tanulo:1
(nil)

> get tanuloo:1
(nil)

> get dfsdfsfds
(nil)

> get tanuloo:nev
(nil)

> get tanuloo.nev
(nil)

> get tanuloo:1
(nil)

> get tanuloo.1
(nil)

> get tanuloo[0]
(nil)

> get tanuloo[nev]
(nil)

> get tanuloo nev
"ERR wrong number of arguments for 'get' command"

> hset tanuloo1 nev "YOOOOO" varos "GYÖNGYÖS"
(integer) 2

> hset tanuloo1 nev "YOOOOO" varos "GYÖNGYÖS111111"
(integer) 0

> hset tanuloo1 nev "YOOOOO" varos "GYÖNGYÖS111111" milyen_hely "legkomolyabb"
(integer) 1

> hset tanuloo:1 nev "béla" varos "gyöngyös" szak "gazdinfo"
(integer) 3

> keys tanulo*
1) "tanulo05"
2) "tanuloo:1"
3) "tanulo02"
4) "tanulo01:neptun"
5) "tanulo01:nev"
6) "tanuloo1"
7) "tanuloo"

> keys tanuloo*
1) "tanuloo:1"
2) "tanuloo1"
3) "tanuloo"

> get tanuloo
"WRONGTYPE Operation against a key holding the wrong kind of value"

> get tanuloo1
"WRONGTYPE Operation against a key holding the wrong kind of value"

> get tanuloo:1
"WRONGTYPE Operation against a key holding the wrong kind of value"

> set payment:1:1:amount 500000
"OK"

> hset payment:1:1 amount 50
(integer) 1

> set payment:1:1:amount 500000
"OK"

> hset payment:1:1 béla 29
(integer) 1

> set payment:1:2:amount dick duck lol
"ERR syntax error"

> set payment:1:2:amount dick
"OK"

> lset sajatlista 1 béla
"ERR no such key"

> set sajatlista {1,2}
"OK"

> get sajatlista
"{1,2}"

> lpush sajatlista 1 bela
"WRONGTYPE Operation against a key holding the wrong kind of value"

> lpush sajatlista 1 [bela]
"WRONGTYPE Operation against a key holding the wrong kind of value"

> lpush sajatlista 1 [bela: asd]
"WRONGTYPE Operation against a key holding the wrong kind of value"

> lpush nevek julcsi tercsi marcsi
"WRONGTYPE Operation against a key holding the wrong kind of value"

> rpush nevek julcsi tercsi marcsi
"WRONGTYPE Operation against a key holding the wrong kind of value"

> rpush nevek1 julcsi tercsi marcsi
(integer) 3

> get nevek
"WRONGTYPE Operation against a key holding the wrong kind of value"

> lpush nevek2 julcsi tercsi marcsi
(integer) 3

> rpush nevek2 béla
(integer) 4

> lpush nevek2 mari
(integer) 5

> lrange nevek2 1 3
1) "marcsi"
2) "tercsi"
3) "julcsi"

> lrange nevek2 1 1
1) "marcsi"

> lrange nevek2 1 2
1) "marcsi"
2) "tercsi"

> lrange 0 9
"ERR wrong number of arguments for 'lrange' command"

> lrange 0 4
"ERR wrong number of arguments for 'lrange' command"

> lrange nevek2 0 9
1) "mari"
2) "marcsi"
3) "tercsi"
4) "julcsi"
5) "b\xc3\xa9la"

> lrange nevek2 0 9999
1) "mari"
2) "marcsi"
3) "tercsi"
4) "julcsi"
5) "b\xc3\xa9la"

> lrange nevek2 0 -1
1) "mari"
2) "marcsi"
3) "tercsi"
4) "julcsi"
5) "b\xc3\xa9la"

> sadd halmaz1 1 2 3 4 5
(integer) 5

> sadd halmaz2 4 5 6
(integer) 3

> sunion halmaz1 halmaz2
1) "1"
2) "2"
3) "3"
4) "4"
5) "5"
6) "6"

> sinter halmaz1 halmaz2
1) "4"
2) "5"

> sdiff halmaz1 halmaz2
1) "1"
2) "2"
3) "3"

> zadd nevekkk "juci" 1 "julcsika" 2
"ERR value is not a valid float"

> zadd nevekkk 1 "juci" 2 "julcsika"
(integer) 2

> zadd nevekkk 8 "aranka" 5 "bélaa" 10 "béla" 1 "juci" 2 "julcsika"
(integer) 3

> zrange nevekk 0 -1
(empty list or set)

> zrange nevekkk 0 -1
1) "juci"
2) "julcsika"
3) "b\xc3\xa9laa"
4) "aranka"
5) "b\xc3\xa9la"

> zincrby béla 69
"ERR wrong number of arguments for 'zincrby' command"

> zincrby nevekkk 69 béla
"79"

> zadd teszt 100 margit 110 margit2
(integer) 2

> zrange teszt 0 -1
1) "margit"
2) "margit2"

> zincrby teszt 120 margit
"220"

> zrange teszt 0 -1
1) "margit2"
2) "margit"

> zrange teszt 0 -1 withscores
1) "margit2"
2) "110"
3) "margit"
4) "220"

> zincrby teszt 111 margit2
"221"

> zrange teszt 0 -1
1) "margit"
2) "margit2"

> zrange teszt 0 -1 withscores
1) "margit"
2) "220"
3) "margit2"
4) "221"